Revit 2027 API
FabricationServiceButton.IsUnrestrictedCondition Method
 Checks if the condition is unrestricted.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsUnrestrictedCondition(
	int condition
)
Public Function IsUnrestrictedCondition (
	condition As Integer
) As Boolean
public:
bool IsUnrestrictedCondition(
	int condition
)
member IsUnrestrictedCondition :
        condition : int -> bool
Parameters
condition Int32
 The condition index.
Return Value
Boolean
 True if the condition is unrestricted.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  The index condition is not larger or equal to 0 and less than ConditionCount.
See Also
Reference
FabricationServiceButton Class
Autodesk.Revit.DB Namespace